app/controllers/api/v0/projects_controller.rb

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO "projects" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "novo"], ["description", "teste"], ["created_at", 2017-06-09 01:56:37 UTC], ["updated_at", 2017-06-09 01:56:37 UTC]]