app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "New project"], ["description", "new project"], ["created_at", 2017-05-27 18:17:44 UTC], ["updated_at", 2017-05-27 18:17:44 UTC]]

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "title" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["title", "outro projetoasidjaoisjd"], ["updated_at", 2017-06-10 20:48:49 UTC], ["id", 8]]