app/controllers/tasks_controller.rb

	def create
		@task = @project.tasks.create( task_params )
---
INSERT INTO "tasks" ("content", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "teste"], ["project_id", 1], ["created_at", 2017-05-27 18:17:48 UTC], ["updated_at", 2017-05-27 18:17:48 UTC]]

	def destroy
		@task = @project.tasks.find(params[:id])

		if @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 4], ["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]

	def complete
		if @task.update_attribute(:completed_at, Time.now)
---
UPDATE "tasks" SET "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed_at", 2017-01-30 01:40:24 UTC], ["updated_at", 2017-01-30 01:40:24 UTC], ["id", 2]]

	def set_task
		@task = @project.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 4], ["id", 2], ["LIMIT", 1]]