app/controllers/time_sheets_controller.rb

  def index
    @time_sheets = TimeSheet.all
---
SELECT "time_sheets".* FROM "time_sheets"